# Taps
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Fonts
cask "font-hack-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"

# Apps
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "omnidisksweeper"
cask "notion"
cask "google-chrome"
cask "spotify"
cask "microsoft-office"

# Languages
brew "python3"
brew "python@3.9"
brew "python@3.8"
brew "go"
brew "scala"
brew "openjdk@11"

# Tools
brew "git"
brew "git-extras"
brew "gh"
brew "maven"
brew "gradle"
brew "node"
brew "minikube"
brew "neovim"
brew "scipy"
brew "wget"
brew "sbt"

# Services
brew "apache-arrow"
brew "apache-flink"
brew "apache-spark"
brew "hadoop", link: false
brew "zookeeper"
brew "kafka"
brew "docker"
brew "elastic/tap/elasticsearch-full"
brew "elastic/tap/kibana-full"

# Databases
brew "pgcli"
brew "postgresql@14"

# Shell
brew "bat"
brew "exa"
brew "antigen"
brew "coreutils"
brew "fish"
brew "fisher"
brew "ammonite-repl"
brew "starship"

# Misc
brew "flake8"
brew "isort"
brew "poetry"
brew "sqlfluff"

# Quality of Life
brew "cowsay"
brew "fortune"
