# Taps
tap "coursier/formulas"
tap "elastic/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

# Fonts
cask "font-hack-nerd-font"
cask "font-inconsolata"

# Apps

# Languages
brew "python@3.9"
brew "python@3.8"
brew "go"
brew "scala"
brew "java11"

# Tools
brew "git"
brew "git-extras"
brew "gh"
brew "maven"
brew "gradle"
brew "node"
brew "minikube"
brew "neovim"
brew "scipy"
brew "wget"
brew "sbt"

# Services
brew "apache-arrow"
brew "apache-flink"
brew "apache-spark"
brew "hadoop", link: false
brew "zookeeper"
brew "kafka"
brew "docker"
brew "elastic/tap/elasticsearch-full"
brew "elastic/tap/kibana-full"

# Databases
brew "pgcli"
brew "postgresql@14"

# Shell
brew "exa"
brew "antigen"
brew "coreutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "ammonite-repl"
brew "starship"

# Misc
brew "flake8"
brew "isort"
brew "poetry"
brew "sqlfluff"

# Quality of Life
brew "cowsay"
brew "fortune"
